tutorials/viscoelasticFluidFoam/White-Metzner/Carreau-Yasuda/system/sampleDicttauxy
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPointFace;

writeFormat     raw;

sampleSets
(

// x axes Ux upstream profile
    uniform
    {
        name            fig6_x_037;
        axis            distance;
        start           (0.25482  0.0    0.00016);
        end             (0.25482  0.0128 0.00016);
        nPoints         100;
    }


    uniform
    {
        name            fig6_x_05;
        axis            distance;
        start           (0.2544  0.0    0.00016);
        end             (0.2544  0.0128 0.00016);
        nPoints         100;
    }


    uniform
    {
        name            fig6_x_1;
        axis            distance;
        start           (0.2528  0.0    0.00016);
        end             (0.2528  0.0128 0.00016);
        nPoints         100;
    }


    uniform
    {
        name            fig6_x_15;
        axis            distance;
        start           (0.2512  0.0    0.00016);
        end             (0.2512  0.0128 0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_x_2;
        axis            distance;
        start           (0.2496  0.0    0.00016);
        end             (0.2496  0.0128 0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_x_10;
        axis            distance;
        start           (0.2240  0.0    0.00016);
        end             (0.2240  0.0128 0.00016);
        nPoints         100;
    }


// y axes Ux upstream profile

    uniform
    {
        name            fig6_y_1;
        axis            distance;
        start           (0.2432     0.0032  0.00016);
        end             (0.2544  0.0032  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_y_15;
        axis            distance;
        start           ( 0.2432    0.0048  0.00016);
        end             (0.2544  0.0048  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_y_2;
        axis            distance;
        start           ( 0.2432    0.0064  0.00016);
        end             (0.2544  0.0064  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_y_25;
        axis            distance;
        start           ( 0.2432    0.0080  0.00016);
        end             (0.2544  0.0080  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_y_3;
        axis            distance;
        start           (0.2432    0.0096  0.00016);
        end             (0.2544  0.0096  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig6_y_35;
        axis            distance;
        start           (0.2432    0.0112  0.00016);
        end             (0.2544  0.0112  0.00016);
        nPoints         100;
    }


// x axes Ux downstream profile

    uniform
    {
        name            fig9_x_5;
        axis            distance;
        start           (0.2720  0.0    0.00016);
        end             (0.2720  0.00288 0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig9_x_1;
        axis            distance;
        start           (0.2592  0.0    0.00016);
        end             (0.2592  0.00288 0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig9_x_05;
        axis            distance;
        start           (0.2576  0.0    0.00016);
        end             (0.2576  0.00288 0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig9_x_0;
        axis            distance;
        start           (0.2560  0.0    0.00016);
        end             (0.2560  0.00288 0.00016);
        nPoints         100;
    }

// y axes Ux downstream profile

    uniform
    {
        name            fig9_y_1;
        axis            distance;
        start           (0.2272     0.0032  0.00016);
        end             (0.2752     0.0032  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig9_y_04;
        axis            distance;
        start           (0.2272     0.00128  0.00016);
        end             (0.2752     0.00128  0.00016);
        nPoints         100;
    }

    uniform
    {
        name            fig9_y_0;
        axis            distance;
        start           (0.2272     0.0  0.00016);
        end             (0.2752     0.0  0.00016);
        nPoints         100;
    }

);

fields
(
    tauxy

);


// ************************************************************************* //
